{"name":"Oversimplified Cause Fallacy", "steps":["Is a single factor being presented as THE cause of a complex outcome?", "Does the argument reduce multiple potential causes to just one cause?", "Is there an oversimplified either/or thinking about causation?", "Does the reasoning follow the pattern: X contributes to Y, both are present, therefore removing X will remove Y?", "Does the argument ignore other contributing factors?", "Does the conclusion assume a simple cause-and-effect relationship where a complex causal array actually exists?"], "ground_truths":["yes", "yes", "yes", "yes", "yes", "yes"], "operations":["or", "and", "and", "and", "and"]},
{"name":"Overwhelming Exception", "steps":["Is there a general claim or generalization being made?", "Are there multiple exceptions or qualifications to this claim?", "Do these exceptions eliminate a significant number of cases that would normally support the generalization?", "Does the argument become substantially weaker due to the numerous exceptions?", "If the exceptions are listed, are the exceptions being used as the primary support for the claim rather than actual evidence? If the exceptions are not listed, default to 'yes' for this instruction.", "Does the arguer still conclude the original generalization is true despite the overwhelming exceptions?"], "ground_truths":["yes", "yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and", "and"]},
{"name":"Package Deal Fallacy", "steps":["Does the argument mention at least two things that are commonly associated or grouped?", "Does the argument assume these things MUST always be together or cannot be separated?", "Does the argument claim that ungrouping them will have significantly severe effects without proper justification?", "Does the reasoning jump from 'usually together' to 'cannot be apart' without sufficient evidence?"],"ground_truths":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]},
{"name":"Poisoning the Well", "steps":["Is the adverse information about a person presented before their argument?", "Is this adverse information used to discredit the person's credibility or character?", "Does the conclusion suggest that the person's claims should be dismissed based on this adverse information?"], "ground_truths":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]},
{"name":"Political Correctness Fallacy", "steps":["Does the argument involve rejecting or accepting a claim based on political correctness considerations rather than factual merit?", "Does the reasoning assume that politically incorrect statements are automatically false?", "Does it assume that groups, individuals, or ideas must be treated as equal solely to avoid offense?", "Does the argument prioritize avoiding social/institutional offense over logical evaluation?", "Is the conclusion reached through political correctness standards rather than evidence or rational analysis?", "Is it an over-correction that dismisses potentially valid points simply because they may be offensive or politically incorrect?"], "ground_truths":["yes", "yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and", "and"]},
{"name":"Post Designation", "steps":["Was a sample analyzed in the argument?", "Were there correlations found in the sample?", "Were the correlations declared in advance as expected findings?", "Are conclusions being drawn from the correlations only after examining the data?", "Is the correlation being treated as meaningful without statistical justification?"], "ground_truths":["yes", "yes", "no", "yes", "yes"], "operations":["and", "and", "and", "and"]},
{"name":"Pragmatic Fallacy", "steps": ["Does the statement claim something is true based on results from believing it?", "Does the argument use someone's experience as evidence?", "Does the statement contain phrases like 'it works,' 'it helps,' or references to positive outcomes from belief?", "Is the statement confusing the usefulness/benefit of believing something with whether that something is actually true?", "Does the logical structure follow: belief → practical benefit → therefore true?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Prejudicial Language", "steps": ["Does the statement make a claim or proposition?", "Does the claim or proposition use loaded or emotive terms?", "Are these terms used to manipulate judgment rather than provide logical evidence?", "Does the argument rely on the emotional impact of the language to make the claim seem true or credible?", "Are the terms substituting for actual reasoning or evidence?", "Does removing the terms weaken the argument's persuasive power without affecting its logical validity?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Proof Surrogate",  "steps": ["Is a claim being made in the statement?", "Is the claim presented as the supporting proof or evidence?", "Is actual proof or evidence provided?", "Does the claim rely on language that implies evidence exists without actually providing any?"], "ground_truths": ["yes", "yes", "no", "yes"], "operations": ["and", "and", "and"]},
{"name":"Proof by Intimidation",  "steps":["Is the argument presented in a difficult-to-understand manner?", "Does the complexity appear purposeful rather than naturally required by the subject matter?", "Does the argument rely on intimidating the audience or the audience's fear of questioning authority or assumptions?","Will the argument be weakened significantly if presented in simpler, clearer terms?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Proving Non Existence",  "steps":["Is the claim about something's existence?", "Is adequate evidence provided for the existence claim?", "Does the argument shift the burden of proof by demanding others prove non-existence?", "Is proof of universal/absolute non-existence requested?", "Does the argument conclude that something must exist simply because it cannot be disproven?", "Does the logical structure follow: 'I can't prove X exists, so you prove it doesn't - if you can't, then X exists?"], "ground_truths": ["yes", "no", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Psychogenetic Fallacy", "steps":["Does someone make an argument or claim in the statement?", "Is a psychological reason or motive attributed to why the person made that argument?", "Is the argument dismissed solely on the grounds of the psychological reason?", "Is it true that no actual evaluation of the argument's logical merit or evidence is provided?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Quantifier Shift Fallacy", "steps":["Does the statement contain two quantifiers (universal and existential)?", "Does the original statement have the form 'Every X has a related Y'?", "Does the conclusion claim 'There is some Y related to every X'?", "Is the order of quantifiers reversed between premise and conclusion?", "Does the reversal change the logical meaning inappropriately?", "Does this reversal lead to an invalid inference?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Quantum Physics Fallacy", "steps":["Does the statement make a claim about quantum physics OR use quantum physics terminology?", "Is the claim being supported actually related to quantum physics?", "Are quantum physics principles misapplied to support unrelated claims (e.g., religious, consciousness, supernatural, etc.)?", "Is the connection between quantum physics and the conclusion logically valid?", "Does the statement exploit the complexity/mystery of quantum physics to gain false credibility?"], "ground_truths": ["yes", "no", "yes", "no", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Questionable Cause", "steps":["Does the argument claim a causal relationship between two events?", "Is the only evidence provided that the two things are regularly associated?", "Does the argument infer causation from mere association without adequate supporting evidence?"], "ground_truths": ["yes", "yes", "yes"], "operations": ["and", "and"]},
{"name":"Rationalization", "steps":["Is the statement defending a claim?", "Are there reasons provided to defend the claim?", "Are the stated reasons the genuine motivation behind the claim?", "Are there more authentic reasons that are not provided for the claim?", "Are the reasons provided more persuasive, or less embarrassing, or less harsh compared to the reasons not provided?", "Are the false or inauthentic reasons being substituted for the true reason?"], "ground_truths": ["yes", "yes", "no", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Red Herring", "steps":["Is there more than one argument being presented?", "Are those arguments unrelated or only tangentially related?", "Is the introduction of Argument B deliberate rather than accidental?", "Is the original argument (Argument A) abandoned or ignored after Argument B is introduced?", "Does the person introducing Argument B seem to be trying to divert attention from the original argument A?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Reductio ad Absurdum", "steps":["Does the argument take an opponent's proposition or claim as a starting assumption?", "Does the argument follow the logical implications of that assumption to reduce the proposition or claim?" ,"Does the reasoning lead to a contradictory conclusion (both Q and not-Q) or an obviously absurd result?","Does the argument conclude that the original proposition must be false based on reaching this contradiction/absurdity?","Does the argument structure follows: Assume P → Derive contradiction → Therefore P is false"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Reductio ad Hitlerum", "steps":["Does the argument make a comparison or connection to Hitler or the Nazi party?", "Is this comparison used to discredit an opposing argument or position?", "Is the Hitler/Nazi reference relevant to the actual merits of the argument being discussed?", "Is the conclusion being drawn that something is false or bad simply because of its association with Hitler/Nazis?", "Does the argument lack substantive counter-evidence and rely primarily on the Hitler comparison to invalidate the opposing position?"], "ground_truths": ["yes", "yes", "no", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Regression Fallacy", "steps":["Are there two events (A and B) where B follows A chronologically?", "Is event B something that naturally fluctuates or varies over time?","Does the argument claim A caused B based solely on the temporal sequence?","Does the argument fail to consider or acknowledge the natural fluctuations of B?","Does the argument ignores other potential causes or random variation?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Reification", "steps":["Does the statement contain an abstract concept, belief, or hypothetical construct?", "Is this abstraction being treated as if it were a concrete, physical, or real entity?","Does the argument's conclusion depend on treating the abstraction as tangible or physically real?","Will the argument be invalid if the abstraction were properly recognized as non-physical or hypothetical?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Relative Privation", "steps":["Does the statement contain a comparison of two scenarios?", "Does one of the scenarios represent an extreme case (best-case or worst-case)?", "Is the comparison used to make the other scenario (scenario S) appear better or worse than it actually is?", "Is the conclusion about scenario S's quality based primarily on this extreme comparison rather than objective evaluation?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Retrogressive Causation","steps":["Is there a claimed causal relationship where X causes or is the source of Y?", "Is Y presented as a negative effect or problem that needs to be eliminated/relieved?", "Does the proposed solution involve doing more of X (the original cause/source)?", "Does the logic suggest using the cause to eliminate its own effect?", "Does the argument use the source of a problem as its own solution?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Righteousness Fallacy", "steps":["Is someone else making a factual claim or assertion?", "Is the person making the claim portrayed as having good intentions?", "Does the argument conclude that the claim is true primarily because of the person's good intentions?", "Does the argument lack other evidence or reasoning to support the actual truth of the claim?", "Is the connection between good intentions and factual accuracy being treated as logically valid?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Rights To Ought Fallacy","steps":["Does the argument involve a claim about what someone 'should' do?", "Does the argument use having a 'right' to do something as justification?", "Does the argument conflate legal or constitutional rights with moral obligations or optimal actions?", "Does the reasoning follow the pattern: 'Person has the right to do X, therefore person should do X'?", "Does the argument attempt to use objective legal rights to support subjective moral positions?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Scapegoating","steps":["Is there blame being assigned to a person or group?","Is the blamed party unpopular, or an easy target?","Is the blame disproportionate or unfair given the evidence?","Does the blamed party actually have a causal connection to the problem?","Does the blame deflect attention from more likely or complex causes?"], "ground_truths": ["yes", "yes", "yes", "no", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Selective Attention","steps":["Has information or an argument been presented with multiple aspects, points, or components?","Does the response address only some parts of the original information?","Are portions of the original argument completely ignored or missed?", "Does the selective focus lead to misrepresentation of the original argument?", "Is the ignored information relevant and important to the overall argument?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Self Righteousness Fallacy","steps":["Is the person making a claim?","Does the person explicitly or implicitly reference their good intentions?","Does the person use ONLY their good intentions as evidence or justification for the truth of their claim?","Does the argument structure follow: 'I have good intentions, therefore my claim is true'?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Self Sealing Argument","steps":["Is there a claim (X) being made?","Is there a reason or evidence (Y) provided to support the claim?","Is the reason Y structured in a way that makes it immune to any possible counterevidence?","Is there any potential refutation or contrary evidence that could theoretically challenge reason Y?", "Does the argument prevent any meaningful testing or falsification of the claim?"], "ground_truths": ["yes", "yes", "yes", "no", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Shifting of the Burden of Proof","steps":["Does Person 1 make a claim (Y) that requires justification or evidence?", "Does Person 1 provide adequate justification for their claim Y?","Does Person 1 demand that Person 2 prove the opposite of claim Y instead?", "Does Person 1 conclude that Y is true based on Person 2's inability or refusal to prove the opposite?", "Is this a case involving well-established facts where the burden might legitimately lie with the denier?"], "ground_truths": ["yes", "no", "yes", "yes", "no"], "operations": ["and", "and", "and", "and"]},
{"name":"Shoehorning","steps":["Is someone connecting a current event to their personal, political, or religious agenda?","Is the connection between the event and the agenda rational and logical?", "Is the person force-fitting the interpretation to make the event seem to support their pre-existing beliefs?", "Does the connection rely on after-the-fact reasoning rather than causal relationships?"],"ground_truths": ["yes", "no", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Slippery Slope","steps":["Is there a chain of events presented?","Does the argument start with a relatively minor or insignificant event (A)?","Does the argument claim this leads to increasingly significant events (B, C, etc.)?","Does the argument conclude with an ultimate dramatic or extreme outcome (Z)?", "Are the connections between each step unwarranted?", "Does each subsequent step become increasingly improbable?","Are there at least two events presented in this causal chain?", "Is the progression from initial event to final outcome presented as inevitable without adequate evidence?"]," ground_truths": ["yes", "yes", "yes", "yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and", "and", "and"]},
{"name":"Special Pleading","steps":["Does the statement apply a standard, principle, or rule to others or general circumstances?","Does the same person/source exempt themselves or specific circumstances from that same standard?","Is adequate justification provided for the exemption?","Does the exemption appear to be self-serving?"]," ground_truths": ["yes", "yes", "no", "yes"], "operations": ["and", "and", "and"]},
{"name":"Spin Doctoring","steps":["Does the statement present information?","Is the information X presented in a deceptive way?","Does the presentation encourage a different interpretation(Y)?","Does the presentation cause others to misinterpret the actual facts?", "Compare X and Y - do they align with each other?"], "ground_truths": ["yes", "yes", "yes", "yes", "no"], "operations": ["and", "and", "and", "and"]},
{"name":"Spiritual Fallacy","steps":["Does the statement contain a claim (X) that appear problematic, contradictory, or nonsensical when taken literally?","Does the person responding to criticism or confusion about X dismiss the literal interpretation?", "Does the person then reframe X as having a 'spiritual' meaning instead?", "Does this reframing allow the person to maintain their position while avoiding rational scrutiny?", "Does the spiritual explanation serve as a justification or defense mechanism rather than the original intended meaning?"]," ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Spotlight Fallacy","steps":["Is media coverage being referenced?", "Is a conclusion being drawn about an entire class, group, or category?","Is this conclusion based solely on media representation?","Does the argument assume media coverage is representative of the whole?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Statement of Conversion","steps":["Does the argument involve someone's personal conversion?","Is the conclusion based solely on this conversion experience?", "Is the conversion story itself being used as the primary or sole justification for the claim?"],"ground_truths": ["yes", "yes", "yes"], "operations": ["and", "and"]},
{"name":"Stereotyping the fallacy","steps":["Does the statement make a broad generalization about a group such as All X's have property Y?", "Is this generalization based on characterization rather than verified facts?","Is a specific individual or case (Z) being categorized as part of that group (X)?","Does the conclusion assign the generalized property (Y) to the specific case (Z) based solely on group membership?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Stolen Concept Fallacy","steps":["Is there a concept (X) the person is trying to disprove?","Do the arguments or reasoning used to disapprove X require the truth of X itself?","Is the person using X as a foundation while simultaneously claiming X is false?","Without accepting X, would the argument against X collapse or be impossible to make?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Strawman Fallacy","steps":["Are there two parties in disagreement (Person 1 and Person 2)?","Is Person 1's original claim or position different from how Person 2 restates or represents Person 1's position?","Does Person 2 attack this altered version rather than the original claim?","Does Person 2 conclude the original claim is false based on refuting the distorted version?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Style Over Substance","steps":["Is there a claim or argument being made?","Is the claim supported by compelling language, rhetoric, or visual aesthetics rather than logical evidence or factual support?","Is the conclusion drawn primarily because the claim is catchy, eloquent, or visually appealing?","Is substance/logical reasoning lacking while style/presentation is emphasized?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Subjectivist Fallacy","steps":["Is there a claim being made about truth or reality?","Does someone respond by saying this truth only applies to certain people or is subjective?","Does empirical evidence exist that demonstrates the claim is objectively true for everyone?","Is the person dismissing objective evidence by claiming the matter is subjective or relative?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Subverted Support","steps":["Does the statement claim to explain a phenomenon (X happens because of Y)?","Does the phenomenon (X) actually occur or exist?","Is there credible evidence supporting the existence of the phenomenon?"]," ground_truths": ["yes", "no", "no"], "operations": ["and", "and"]},
{"name":"Sunk Cost Fallacy","steps":["Is there a past investment (time, money, effort, resources) that has already been made?","Is there a proposal or argument for additional future investment?","Is the justification for the future investment primarily based on not wanting to lose or waste the past investment?","Does the argument fail to properly weigh the total costs and benefits of continuing versus stopping?"],"ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Suppressed Correlative","steps":["Are there two mutually exclusive categories being discussed (X and not-X)?","Is one person initially presenting these as genuine alternatives where both options are possible?","Does another person redefine one of the categories (usually X) in a way that absorbs or encompasses the other category?","Does this redefinition make the distinction meaningless by eliminating one of the original alternatives?","Does the redefinition render the original term essentially meaningless due to over-expansion?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Survivorship Fallacy","steps":["Does the argument draw a conclusion based on testimonies or examples?","Are there two groups: those who succeeded/survived and those who failed/did not survive?","Are only the successful/surviving group's experiences being considered?","Are the unsuccessful/non-surviving group's testimonies absent or ignored?","Does the argument generalize from the limited 'winner' sample to make broader claims?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Texas Sharpshooter Fallacy","steps":["Are two or more things (X and Y) being compared?","Are multiple criteria or data points available for comparison?","Are only certain criteria/similarities being highlighted while differences are ignored?","Is the selection of criteria appears to support a predetermined desired outcome?","Is the biased selection a result of deliberate misleading?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Tokenism","steps":["Is a specific problem or issue being discussed?","Has a solution or response been proposed to address the problem?","Is the proposed solution genuinely adequate to solve the identified problem?","Is the inadequate solution being presented or accepted as if it were sufficient?"],"ground_truths": ["yes", "yes", "no", "yes"], "operations": ["and", "and", "and"]},
{"name":"Traitorous Critic Fallacy","steps":["Is there criticism being made by one person against a group they belong to or are associated with?","Does the response to the criticism attack the critic's loyalty or allegiance rather than addressing the actual criticism?","Are there suggestions that the critic should leave the group or stay away from the issue?","Is the criticism actually addressed on its merits?","Is the respondent deflecting by questioning the critic's group membership or loyalty?"], "ground_truths": ["yes", "yes", "yes", "no", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Two Wrongs Make a Right","steps":["Are there two parties involved in the statement?","Is one party justifying an action they took or want to take?","Is the justification based on the other party having done the same action to them OR the belief that the other party would do the same action to them?","Is other moral or logical justification provided beyond the reciprocal nature of the action?"], "ground_truths": ["yes", "yes", "yes", "no"], "operations": ["and", "and", "and"]},
{"name":"Type Token Fallacy","steps":["Can a word or phrase in the statement refer to both a type (abstract concept/category) and a token (specific instance/object of that concept)?","Does the statement shift between discussing the type and the token with clear distinction?","Does the ambiguity between type and token create confusion or misleading reasoning?","Do responses or conclusions shift between addressing the type and the token with clear distinction?","Does this type-token confusion affect the validity of the argument or statement?"], "ground_truths": ["yes", "no", "yes", "no", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Unfalsifiability","steps":["Is a claim being asserted as definitively true or false?","Can the claim be tested through observation or physical experiment?","Does there exist any possible evidence that could approve or disprove the claim?","Is the assertion made with confidence despite lack of testable evidence?"], "ground_truths": ["yes", "no", "no", "yes"], "operations": ["and", "and", "and"]},
{"name":"Unwarranted Contrast","steps":["Does the argument involve a statement about 'some' members of a group having a particular property?","Does the argument then conclude that 'some' members of that same group do NOT have that property (or vice versa)?","Is this conclusion drawn solely based on the implicature (what is suggested) rather than the logical implication (what is actually stated)?","Is the contrast being drawn unwarranted because the original statement doesn't logically require the opposite to be true?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
{"name":"Use Mention Error","steps":["Does the statement involve a word or term being discussed?","Is the word itself (the mention) being confused with what the word refers to (the use)?","Are there missing quotation marks around words that should be treated as words rather than their referents?","Does the statement treat 'X' (the word) as equivalent to X (the thing the word describes)?","Does this confusion between word and referent create an invalid logical connection?","Is this error being used to create a false equivalence or equivocation?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Weak Analogy","steps":["Is an analogy being used to support an argument?","Are two things are being compared (X and Y)?","Is a property or characteristic (P) attributed to Y?","Does the argument concludes that X also has property P based on the analogy?","Do the differences between X and Y outweigh the similarities?","Are the dissimilarities significant enough to make the analogy ineffective for the argument?"], "ground_truths": ["yes", "yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and", "and"]},
{"name":"Willed Ignorance","steps":["Does the person hold a specific belief or position (X)?", "Is contradictory evidence or information (Y) presented to them?", "Does the person actively refuse to examine or consider the conflicting evidence?","Is the refusal motivated by a desire to maintain their existing belief?","Is the rejection based on willful avoidance rather than legitimate criticism of the evidence quality?"]," ground_truths": ["yes", "yes", "yes", "yes", "yes"], "operations": ["and", "and", "and", "and"]},
{"name":"Wishful Thinking","steps":["Does the argument contain a desired outcome or wish?","Is this desire being used as evidence or justification?", "Is actual supporting evidence absent or inadequate?","Does the conclusion rely primarily on the person's wanting it to be true?"], "ground_truths": ["yes", "yes", "yes", "yes"], "operations": ["and", "and", "and"]},
