{"name": "Accent Fallacy", "steps" : ["Is there an original claim or statement being made?", "Is there an emphasis or accent placed in the original statement?", "Is the statement being reinterpreted with the emphasis on a different word or phrase?", "Does this shift in accent change the meaning of the statement?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Accident Fallacy", "steps" : ["Is there a general rule or principle being stated or referenced?", "Is that rule being applied universally without consideration of exceptions?", "Are there legitimate exceptions to the rule that should be considered?", "Does the argument ignore or dismiss these exceptions to maintain the rule's absolute application?", "Does the conclusion treat the general rule as having no exceptions whatsoever?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]} 
{"name": "Ad Fidentia", "steps" : ["Is there an argument or claim being made by a person?", "Does the response address the actual argument/evidence presented?", "Does the response question or attack the person's confidence?", "Is that conclusion drawn based on the person's perceived lack of confidence rather than on the merits of the argument?"], "ground_truth":["yes", "no", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Ad Hoc Rescue", "steps" : ["Is there an original claim (X) made?", "Does the evidence initially provided (Y) support the claim (X)?", "Has the original evidence (Y) been refuted or demonstrated to be unacceptable?", "Has a new explanation or reason (Z) been introduced to maintain the original claim?", "Does that new explanation (Z) lack proper evidence or support?", "Does that new explanation appear to be created specifically to rescue the original claim?", "Does the pattern show attempts to maintain a belief despite contradictory evidence?"], "ground_truth":["yes", "yes", "yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and", "and", "and"]}
{"name": "Ad Hominem Abusive", "steps" : ["Is there an argument/claim (Y) made by person X?", "Is there a personal attack (Z) made against person X?", "Is the personal attack completely irrelevant to the validity of the argument being made?", "Is the personal attack being used as grounds to reject or discredit the original argument?", "Does the reasoning follow this pattern: 'Person X claims Y, Person X has negative trait Z, therefore Y is false'?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Ad Hominem Circumstantial", "steps" : ["Are there two opposing positions or people in the argument?", "Is Person 1 making a claim or an argument (Y)?", "Does Person 2 attack Person 1's circumstances, bias, or vested interests rather than addressing the argument itself?", "Does the attack suggest that Person 1's circumstances make them predisposed to their position?", "Is the conclusion that Person 1's argument is invalid solely because of their circumstances, bias, or vested interests?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Ad Hominem Guilt by Association", "steps" : ["Are there two or more people/groups being discussed?", "Does that negative judgment of the associated person/group already exist?", "Is one person/group being judged negatively based on their association with another person/group?", "Does that argument dismiss or attack the first person/group solely because of this association?", "Is the association irrelevant to the actual argument or claim being made?", "Does the reasoning follow this pattern: 'X associates with Y, Y is bad, therefore X is bad'?"], "ground_truth":["yes", "yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and", "and"]}
{"name": "Ad Hominem Tu quoque", "steps" : ["Are there two parties - one making an argument/claim and another responding?", "Does the responding party point out inconsistencies between the first party's argument and their actions?", "Does the responding party conclude that the argument is false based solely on this inconsistency?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Affirmative Conclusion from a Negative Premise", "steps" : ["Is the argument structured as a categorical syllogism?", "Does at least one of the premises contain a negative statement?", "Is the conclusion an affirmative statement?", "Is there a valid logical path from the negative premise to the affirmative conclusion?"], "ground_truth":["yes", "yes", "yes", "no"], "operations":["and", "and", "and"]}
{"name": "Affirming a Disjunct", "steps" : ["Is there a disjunctive statement (P or Q) presented?", "Is one of the disjuncts affirmed as true?", "Is the other disjunct claimed as false?", "Is the second disjunct claimed as false solely because the first disjunct was claimed as true?", "Is the 'or' defined as exclusive?", "Does it follow this logical structure: 'P or Q, P/Q is true, therefore not Q/not P'?"], "ground_truth":["yes", "yes", "yes", "yes", "no", "yes"], "operations":["and", "and", "and", "and", "and"]}
{"name": "Affirming the Consequent", "steps" : ["Is there a conditional statement (If P then Q)?", "Is the consequent (Q) stated as true?", "Does the reasoning flow from Q being true to P being true?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Alleged Certainty", "steps" : ["Is a definitive conclusion being asserted?", "Does the statement use language that implies universal knowledge or certainty (e.g., 'everybody knows', 'it's obvious', 'clearly', 'without doubt')?", "Is the certainty claim used as the primary or sole justification for the conclusion?", "Is the conclusion's truth value actually uncertain or debatable despite the confident presentation?", "Does the argument's strength rely on the appearance of certainty rather than substantive reasoning?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Alphabet Soup", "steps" : ["Does the speaker use excessive acronyms and abbreviations?", "Are the acronyms/abbreviations used deliberately rather than naturally?", "Does the usage appear intended to make the speaker seem more knowledgeable?", "Do the acronyms/abbreviations serve to confuse or intimidate the audience?", "Is the conclusion drawn that the person is credible simply because they use technical language?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Alternative Advance", "steps" : ["Are there only two options presented?", "Are both options essentially identical despite different wording?", "Do other viable alternatives exist but are not mentioned?", "Does the person accept these limited options without considering other possibilities?", "Does the acceptance appear to be on a subconscious level rather than deliberate reasoning?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Amazing Familiarity", "steps" : ["Is there a main claim or statement being made?", "Does the claim require omniscient or impossible-to-obtain knowledge or information?", "Would the person making the claim reasonably have access to this information?"], "ground_truth":["yes", "yes", "no"], "operations":["and", "and"]}
{"name": "Ambiguity Fallacy", "steps" : ["Is there an unclear phrase or term with multiple possible meanings in the argument?", "Is this ambiguous phrase or term used to support a conclusion?", "Does the conclusion rely on a exclusive interpretation of the ambiguous phrase or term?", "Does the ambiguity undermine the logical connection between the premise and conclusion?", "Would the argument fail if the ambiguous phrase or term was interpreted differently?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Anonymous Authority", "steps" : ["Does the statement makes a claim or assertion?", "Does the statement use an unspecified or vague source as evidence?", "Does the statement contain indicator phrases like 'They say', 'It has been said', 'I heard', 'Studies show', or 'Scientists say'?", "Can the source be verified?", " Does the argument's credibility depends on this unverifiable source?"], "ground_truth":["yes", "yes", "yes", "no", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Anthropomorphism", "steps" : ["Is there a claim or argument that depends on or requires non-human entities (objects, animals, plants, natural phenomena, or gods) being described with human characteristics?"], "ground_truth":["yes"], "operations":[]}
{"name": "Appeal to Accomplishment", "steps" : ["Is an argument or claim being made?", "Is the argument being defended or attacked based on the arguer's level of accomplishment rather than the argument's merit?", "Is the argument's truth value being established through the accomplishments of the person making it?", "Does the logical connection rely on status/achievement rather than factual evidence or sound reasoning?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Anger", "steps" : ["Is the person making the claim expressing anger, hatred, or rage?", "Is the emotional response being used as the primary justification for the claim?", "Is the conclusion drawn based on the expression of anger rather than merit of evidence?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Authority", "steps" : ["Does the argument cite an authority, expert, or credible source?", "Does the argument claim something is true solely because the authority said so?", "Is the authority actually qualified in the relevant field?", "Does the argument follow the pattern: 'Expert X says Y, therefore Y is true'?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Celebrity", "steps" : ["Is a celebrity or famous person making a claim or endorsement?", "Is the celebrity's fame/status being used as the primary reason to accept the claim?"], "ground_truth":["yes", "yes"], "operations":["and"]}
{"name": "Appeal to Closure", "steps" : ["Is there evidence being presented and evaluated?", "Is there an expressed or implied desire for closure or to 'be done with' the issue?", "Is closure being used as the main justification for accepting otherwise inadequate evidence?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Coincidence", "steps" : ["Is the person instead attributing the result to chance, coincidence, or luck?", "Is there evidence suggesting a causal relationship between X and Y?", "Is the evidence for this relationship strong or compelling?", "Is someone dismissing this evidence?", "Does the dismissal contradict all the available evidence?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Appeal to Common Belief", "steps" : ["Does the argument claim that many/most people believe something?", "Is this popular belief presented as evidence for the truth of the claim?", "Does the argument have independent evidence beyond the appeal to numbers?", "Does the argument follow the pattern: 'Many people believe X, therefore X is true'?"], "ground_truth":["yes", "yes", "no", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Common Folk", "steps" : ["Is the speaker emphasizing their status as a 'regular person' or 'common folk'?", "Is the speaker trying to establish a connection with the audience based on shared ordinary/common background?", "Is the speaker using this common folk connection as the primary basis for accepting their argument instead of providing actual evidence?", "Does it follow the logical structure: 'X is just common folk wisdom. Therefore, you should accept X. Person 1 is a common man who proposes Y. You are also a common man. Therefore, you should accept Y'?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Common Sense", "steps" : ["Does the argument claim something is 'common sense' or 'obvious'?", "Does the 'common sense' assertion actually require further evidence?", "Does the argument fail to provide actual reasoning or evidence beyond the 'common sense' claim?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Complexity", "steps" : ["Does the person claim they don't understand the argument?", "Do they conclude the argument is false, flawed, or improbable?", "Is the conclusion based solely on their lack of understanding?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Consequences", "steps" : ["Does the statement make a claim about something being true or false?", "Is the reasoning based on consequences rather than evidence?", "Are the consequences described as desirable or undesirable?", "Is the desirability/undesirability of consequences used as the primary justification?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Definition", "steps" : ["Is a dictionary definition being used as the primary evidence?", "Does the argument claim a term cannot have meanings beyond the dictionary definition?", "Does the argument dismisses expanded, alternative, or evolved meanings of a term?", "Is a contextual or specialized meaning rejected solely because it doesn’t match the dictionary definition?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Appeal to Desperation", "steps" : ["Is there is a claim that 'something must be done' about a situation or problem?", "Is there a specific solution (X) being proposed?", "Does the argument justify the solution mainly because of the urgency of the situation rather than based on its actual merits?", "Does the reasoning follow this pattern: urgent need exists → this is a response → therefore this response must be adopted?", "Does the argument lack proper evaluation of the proposed solution's effectiveness or appropriateness?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Appeal to Emotion", "steps" : ["Is a claim being made in the statement?", "Is legitimate evidence or logical reasoning provided to support the claim?", "Is emotional content being used as the primary or sole justification for the claim?", "Is the emotional appeal intended to manipulate acceptance of the conclusion?"], "ground_truth":["yes", "no", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Equality", "steps" : ["Does the argument claim two or more things are equal or equivalent?", "Is the claimed equality clearly defined and substantiated?", "Is the equality assumption unsupported or vague?", "Does the conclusion depend entirely on this unestablished equality rather than proper evidence?"], "ground_truth":["yes", "no", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Extremes", "steps" : ["Is someone responding to or characterizing an argument?", "Is the original argument reasonable or moderate in scope?", "Does the response take the argument to an unrealistic or absurd extreme?", "Does the extreme version misrepresent the original argument's actual scope or intent?", "Is this a valid reductio ad absurdum which legitimately shows logical consequences?"], "ground_truth":["yes", "yes", "yes", "yes", "no"], "operations":["and", "and", "and", "and"]}
{"name": "Appeal to Faith", "steps" : ["Does the argument avoid reason because reason would disprove the conclusion?", "Does the statement assert that faith is required to understand or accept the argument?"], "ground_truth":["yes", "yes"], "operations":["and"]}
{"name": "Appeal to False Authority", "steps" : ["Does the argument cite a person or source as an authority?", "Does the authority have directly relevant expertise or credentials for the claim they're being used to support?", "Does the argument rely on irrelevant authority to add credibility to the claim?"], "ground_truth":["yes", "no", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Fear", "steps" : ["Does the argument try to use fear as the motivator?", "Does the argument lacks substantial evidence or logical reasoning beyond the fear-based appeal?"], "ground_truth":["yes", "no"], "operations":["and"]}
{"name": "Appeal to Flattery", "steps" : ["Is there an argument or claim being made (X)?", "Are flattery or compliments directed toward the audience/listener?", "Is the flattery being used as support for the argument instead of actual evidence or reasoning?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Force", "steps" : ["Does the argument contain a threat?", "Is the threat directed at the person being asked to accept the conclusion?", "Is the threat intended to coerce agreement?", "Is there additional logical reasoning or evidence supplemented?"], "ground_truth":["yes","yes","yes","no"], "operations":["and", "and", "and"]}
{"name": "Appeal to Heaven", "steps" : ["Does the argument make a claim about what God or gods want/will?", "Is this divine will presented as the primary or sole justification for the conclusion?", "Does the speaker assume they know God's will with certainty?", "Does the argument bypass other forms of reasoning or evidence?", "Is the conclusion presented as mandatory because it aligns with divine will?"], "ground_truth":["yes", "yes", "yes", "yes", "yes"], "operations":["and", "and", "and", "and"]}
{"name": "Appeal to Intuition", "steps" : ["Does the argument rely primarily on intuition or gut feeling?", "Does the person provide logical reasons for their position?", "Is the conclusion based on intuitive feelings rather than reasoned analysis?"], "ground_truth":["yes", "no", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Loyalty", "steps" : ["Is there a relationship of loyalty in the argument?", "Is loyalty being used as the main reasoning for belief or non-questioning?", "Is disagreement with the claim being framed as disloyalty or betrayal?", "Is the truth value of the claim actually independent of the loyalty relationship?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Nature", "steps" : ["Does the statement assign positive value judgments (good, right, beautiful, better, etc.) to the 'natural' thing?", "Does the statement assign negative value judgments (bad, wrong, destructive, worse, etc.) to the 'unnatural' thing?", "Does the argument assume natural = good/positive and unnatural = bad/negative without providing other supporting evidence?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Normality", "steps" : ["Does the argument use social norms or what is considered 'normal' as evidence?", "Does the conclusion claim something is good/bad or desirable/undesirable?", "Does the reasoning connect normality directly to moral value or desirability?", "Does the argument assume normal = good or abnormal = bad?", "Are there any other substantial evidence provided beyond social normality?", "Are there implied conclusions about goodness even if not explicitly stated?"], "ground_truth":["yes", "yes", "yes", "yes", "no", "yes"], "operations":["and", "and", "and", "and", "and"]}
{"name": "Appeal to Novelty", "steps" : ["Does the argument present something new/modern versus something established/old?", "Does the argument claim the new thing is better/superior?", "Is there any substantive evidence provided for why the new thing is actually better?"], "ground_truth":["yes", "yes", "no"], "operations":["and", "and"]}
{"name": "Appeal to Pity", "steps" : ["Is there a claim or conclusion being made?", "Does the argument use emotional appeals related to pity?", "Is the pity-inducing information relevant to the truth or validity of the claim?", "Does the conclusion rely primarily on making the audience feel sorry for someone rather than providing relevant supporting evidence?"], "ground_truth":["yes", "yes", "no", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Popularity", "steps" : ["Does the argument use popularity as evidence?", "Is popularity the reason the conclusion is accepted?", "Does the argument treat popularity as sufficient justification for truth or correctness?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Possibility", "steps" : ["Does the argument present something as possible?", "Does the conclusion treat this possibility as if it were true or probably true?", "Is there sufficient evidence to support the leap from 'possible' to 'true/probable'?"], "ground_truth":["yes", "yes", "no"], "operations":["and", "and"]}
{"name": "Appeal to Ridicule", "steps" : ["Is someone presenting or responding to an argument or claim?", "Does the response misrepresent the original argument or position with exaggeration or distortion that makes the argument appear absurd?", "Is the ridicule being used as evidence that the argument is false?", "Is the conclusion based on ridiculousness rather than actual counterevidence?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Self evident Truth", "steps" : ["Is a claim made without supporting evidence or reasoning?", "Is the claim challenged or questioned by someone requesting evidence?", "Is the response to the challenge that the claim is 'self-evident', 'obvious', or 'doesn't need proof'?", "Is the claim actually self-evident (like basic mathematical or logical truths)?"], "ground_truth":["yes", "yes", "yes", "no"], "operations":["and", "and", "and"]}
{"name": "Appeal to Spite", "steps" : ["Is there a claim or argument being made?", "Is the claim being supported or rejected based on spite, ill will, or hatred toward a person, group, or thing?", "Is spite being substituted for actual evidence?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to Stupidity", "steps" : ["Is the person downplaying, dismissing, or devaluing reason or intellectual discourse?", "Is this devaluation used as a rhetorical strategy?", "Does the person then make a claim, argument, or assertion following this devaluation?", "Is the devaluation of reasoning intended to make the audience more receptive to accepting the subsequent claim?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to Tradition", "steps" : ["Does the argument present historical preferences?", "Are these historical references presented as the primary or sole justification for a current position?", "Does the argument assume that historical precedence automatically makes something correct or desirable?"], "ground_truth":["yes", "yes", "no"], "operations":["and", "and"]}
{"name": "Appeal to Trust", "steps" : ["Is there a source being referenced (person, organization, publication, etc.)?", "Is the source being characterized as trustworthy or untrustworthy?", "Is a claim or argument being made by or attributed to that source?", "Is the conclusion about the claim's truth based solely on the source's perceived trustworthiness rather than the merit of the claim itself?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Appeal to the Law", "steps" : ["Does the argument involves legal status (legal/illegal) and moral judgment (moral/immoral)?", "Does the argument assume legality automatically equals morality or illegality automatically equals immorality?", "Does the argument provide justification for connecting legal status to moral status?"], "ground_truth":["yes", "yes", "yes"], "operations":["and", "and"]}
{"name": "Appeal to the Moon", "steps" : ["Does the statement contain the phrase 'If we can put a man on the moon'?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
{"name": "Argument by Emotive Language", "steps" :["Does the statement make a claim or argument?", "Does the statement use emotionally charged language?", "Is the emotive language being used as the primary support for the claim?", "Is the emotional appeal intended to manipulate acceptance rather than inform?"], "ground_truth":["yes", "yes", "yes", "yes"], "operations":["and", "and", "and"]}
